# ImageQuality Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..ImageQuality Property
DWFExportOptions Class See Also
---
Image quality level when compressed raster format(JPEG) is used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWFImageQuality ImageQuality { get; set; }
```

Visual Basic
---
```text
Public Property ImageQuality As DWFImageQuality
	Get
	Set
```

Visual C++
---
```text
public:
property DWFImageQuality ImageQuality {
	DWFImageQuality get ();
	void set (DWFImageQuality value);
}
```

# Remarks
The default value is Default.
# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace